20211127104120-gemat.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gemat</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">gemat</h1>
<div id="outline-container-orgaeb1d37" class="outline-2">
<h2 id="orgaeb1d37"><a href="#orgaeb1d37">概要</a></h2>
<div class="outline-text-2" id="text-orgaeb1d37">
<p>
gematは<a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a>プロジェクトにおけるGemfileをエクスポートするCLIツールである。
</p>

<dl class="org-dl">
<dt>GitHub repository</dt><dd><a href="https://github.com/kijimaD/gemat/">https://github.com/kijimaD/gemat/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-org867a262" class="outline-2">
<h2 id="org867a262"><a href="#org867a262">Goals</a></h2>
<div class="outline-text-2" id="text-org867a262">
<p>
Gemfileを見やすい形で、有益な情報をエクスポートできるようにすること。
プロジェクトで使われているgemを、学びやすくすること。
</p>

<p>
Bundlerで取ってくる以外の情報源も使えるようにする。
たとえばGitHubの元リポジトリへのリンクがあると便利である。
</p>
</div>
<div id="outline-container-org89a3728" class="outline-3">
<h3 id="org89a3728"><a href="#org89a3728">Non Goals</a></h3>
<div class="outline-text-3" id="text-org89a3728">
<p>
情報表示以上のことは行わない。
</p>
</div>
</div>
</div>
<div id="outline-container-org588a4ea" class="outline-2">
<h2 id="org588a4ea"><a href="#org588a4ea">Background</a></h2>
<div class="outline-text-2" id="text-org588a4ea">
<p>
使っているgemのソースコードを把握したいとき、逐一検索してリポジトリを見つけるのが不便である。
</p>
</div>
</div>
<div id="outline-container-org9d4afd7" class="outline-2">
<h2 id="org9d4afd7"><a href="#org9d4afd7">Detailed Design</a></h2>
<div class="outline-text-2" id="text-org9d4afd7">
</div>
<div id="outline-container-orgafd653d" class="outline-3">
<h3 id="orgafd653d"><a href="#orgafd653d">標準的な使用例</a></h3>
<div class="outline-text-3" id="text-orgafd653d">
<div class="org-src-container">
<pre class="src src-shell">gemat md
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">Progress: |====================================================================|

| gem | Repo URL |
| ---- | ---- |
| csv | https://github.com/ruby/csv |
| httpclient | https://github.com/nahi/httpclient |
| rake | https://github.com/ruby/rake |
| rspec | https://github.com/rspec/rspec |
| rubocop | https://github.com/rubocop/rubocop |
| ruby-progressbar | https://github.com/jfelchner/ruby-progressbar |
| simplecov | https://github.com/simplecov-ruby/simplecov |
| thor | https://github.com/erikhuda/thor |
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Phone</th>
<th scope="col" class="org-right">Age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Peter</td>
<td class="org-right">1234</td>
<td class="org-right">17</td>
</tr>

<tr>
<td class="org-left">Anna</td>
<td class="org-right">4321</td>
<td class="org-right">25</td>
</tr>
</tbody>
</table>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">repo_uri</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">httpclient</td>
<td class="org-left"><a href="https://github.com/nahi/httpclient">https://github.com/nahi/httpclient</a></td>
</tr>

<tr>
<td class="org-left">rake</td>
<td class="org-left"><a href="https://github.com/ruby/rake">https://github.com/ruby/rake</a></td>
</tr>

<tr>
<td class="org-left">ruby-progressbar</td>
<td class="org-left"><a href="https://github.com/jfelchner/ruby-progressbar">https://github.com/jfelchner/ruby-progressbar</a></td>
</tr>

<tr>
<td class="org-left">thor</td>
<td class="org-left"><a href="https://github.com/erikhuda/thor">https://github.com/erikhuda/thor</a></td>
</tr>

<tr>
<td class="org-left">rspec</td>
<td class="org-left"><a href="https://github.com/rspec/rspec">https://github.com/rspec/rspec</a></td>
</tr>

<tr>
<td class="org-left">rubocop</td>
<td class="org-left"><a href="https://github.com/rubocop/rubocop">https://github.com/rubocop/rubocop</a></td>
</tr>

<tr>
<td class="org-left">simplecov</td>
<td class="org-left"><a href="https://github.com/simplecov-ruby/simplecov">https://github.com/simplecov-ruby/simplecov</a></td>
</tr>

<tr>
<td class="org-left">vcr</td>
<td class="org-left"><a href="https://github.com/vcr/vcr">https://github.com/vcr/vcr</a></td>
</tr>

<tr>
<td class="org-left">webmock</td>
<td class="org-left"><a href="https://github.com/bblimke/webmock">https://github.com/bblimke/webmock</a></td>
</tr>
</tbody>
</table>

<p>
<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>では折返しオフにして表示すると見やすい。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq-default</span> truncate-lines t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgede3272" class="outline-3">
<h3 id="orgede3272"><a href="#orgede3272">オプション</a></h3>
<div class="outline-text-3" id="text-orgede3272">
<div class="org-src-container">
<pre class="src src-shell">gemat csv -i <span class="org-string">"other_Gemfile"</span> -o <span class="org-string">"output.csv"</span>-f <span class="org-string">"index,name,repo,star,latest_version,current_version"</span>
</pre>
</div>

<ul class="org-ul">
<li>第1引数(required) : 出力形式(md, CSV)</li>
<li>i(optional) : 使用するGemfileの指定</li>
<li>o(optional) : 出力ファイルの指定</li>
<li>f(optional) : 出力カラムの指定</li>
</ul>
</div>
</div>
<div id="outline-container-org895120a" class="outline-3">
<h3 id="org895120a"><a href="#org895120a">CLI</a></h3>
<div class="outline-text-3" id="text-org895120a">
<p>
Thorを用いる。
</p>
</div>
</div>
<div id="outline-container-orgff23b0c" class="outline-3">
<h3 id="orgff23b0c"><a href="#orgff23b0c">Bundler DSL</a></h3>
<div class="outline-text-3" id="text-orgff23b0c">
<p>
Gemfileの解析には、bundlerがDSLを実行した結果集めた情報を使う。
自分でGemfile読み込みを書かなくてすむ。自分で書くと仕様に追従しないといけないので現実的でない。
</p>
</div>
</div>
<div id="outline-container-org1309eb8" class="outline-3">
<h3 id="org1309eb8"><a href="#org1309eb8">Fetcher</a></h3>
<div class="outline-text-3" id="text-org1309eb8">
<p>
gemfileから読み取った名前を元に、rubygemsにアクセスして情報を取る。
jsonが返ってくる。
</p>
</div>
</div>
<div id="outline-container-orga4b42f7" class="outline-3">
<h3 id="orga4b42f7"><a href="#orga4b42f7">Gem</a></h3>
<div class="outline-text-3" id="text-orga4b42f7">
<p>
jsonで取った情報を加工して、オブジェクトに格納する。
1gemで1オブジェクト。
</p>
</div>
</div>
<div id="outline-container-org638b4a6" class="outline-3">
<h3 id="org638b4a6"><a href="#org638b4a6">Column DSL</a></h3>
<div class="outline-text-3" id="text-org638b4a6">
<p>
カラム指定を解析して、フォーマットするときに利用する。
</p>
</div>
</div>
<div id="outline-container-org49b5439" class="outline-3">
<h3 id="org49b5439"><a href="#org49b5439">Formatter</a></h3>
<div class="outline-text-3" id="text-org49b5439">
<p>
各形式でフォーマットして文字列にする。
</p>
</div>
</div>
<div id="outline-container-org86c6bcc" class="outline-3">
<h3 id="org86c6bcc"><a href="#org86c6bcc">Output</a></h3>
<div class="outline-text-3" id="text-org86c6bcc">
<p>
Formatterが出力した文字列を指定方法で出力する。
</p>

<ul class="org-ul">
<li>標準出力</li>
<li>ファイル</li>
</ul>

<p>
progress barは常に標準出力。
生成したものをどれで出力するか、の指定。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc282a6b" class="outline-2">
<h2 id="orgc282a6b"><a href="#orgc282a6b">技術</a></h2>
<div class="outline-text-2" id="text-orgc282a6b">
<ul class="org-ul">
<li><a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a></li>
<li><a href="20210831223434-rspec.html#ID-afccf86d-70b8-44c0-86a8-cdac25f7dfd3">RSpec</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf2b6420" class="outline-2">
<h2 id="orgf2b6420"><a href="#orgf2b6420">Memo</a></h2>
</div>
<div id="outline-container-orge7d2068" class="outline-2">
<h2 id="orge7d2068"><a href="#orge7d2068">Tasks</a></h2>
<div class="outline-text-2" id="text-orge7d2068">
</div>
<div id="outline-container-orgf830894" class="outline-3">
<h3 id="orgf830894"><a href="#orgf830894">fetchできなかったgemをあとで標準出力に出す</a></h3>
</div>
<div id="outline-container-orgbf4f9e2" class="outline-3">
<h3 id="orgbf4f9e2"><a href="#orgbf4f9e2"><a href="20210926103926-github.html#ID-6b889822-21f1-4a3e-9755-e3ca52fa0bc4">GitHub</a> API</a></h3>
<div class="outline-text-3" id="text-orgbf4f9e2">
<p>
rubygemsにはあまり役に立つ情報がない。
<a href="20210926103926-github.html#ID-6b889822-21f1-4a3e-9755-e3ca52fa0bc4">GitHub</a>へ取りにいけば、面白いのがある可能性。
スター数とか、作者とか。
</p>
</div>
</div>
<div id="outline-container-org1f46144" class="outline-3">
<h3 id="org1f46144"><a href="#org1f46144">たまにURLがおかしいものがある</a></h3>
</div>
<div id="outline-container-org0d48270" class="outline-3">
<h3 id="org0d48270"><a href="#org0d48270">GitHub以外の対応</a></h3>
<div class="outline-text-3" id="text-org0d48270">
<p>
今のところGitLabには対応してない。
根本的に、リポジトリを判別するロジックが雑なのでどうにかしたい。
</p>
</div>
</div>
<div id="outline-container-orga677b39" class="outline-3">
<h3 id="orga677b39"><a href="#orga677b39">ラベルをつける</a></h3>
<div class="outline-text-3" id="text-orga677b39">
<p>
columnを指定できるのはいいのだが、表示は内部で使ってる文字列そのままなのでどうにかしたい。
</p>
</div>
</div>
</div>
<div id="outline-container-org06a828d" class="outline-2">
<h2 id="org06a828d"><a href="#org06a828d">Reference</a></h2>
<div class="outline-text-2" id="text-org06a828d">
<dl class="org-dl">
<dt>GitHub repository</dt><dd><a href="https://github.com/kijimaD/gemat/">https://github.com/kijimaD/gemat/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-orgaac3d1b" class="outline-2">
<h2 id="orgaac3d1b"><a href="#orgaac3d1b">Archives</a></h2>
<div class="outline-text-2" id="text-orgaac3d1b">
</div>
<div id="outline-container-orgb1e00c1" class="outline-3">
<h3 id="orgb1e00c1"><a href="#orgb1e00c1"><span class="done DONE">DONE</span> Fetcher, Gem分割</a></h3>
<div class="outline-text-3" id="text-orgb1e00c1">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
